{
  "name": "microsoft-365-admin-center-mcp-frontier",
  "title": "Microsoft 365 Admin Center (Frontier)",
  "summary": "AI-powered toolbox to accelerate Microsoft 365 administration (bulk CSV user onboarding, validation, and reporting).",
  "description": "Admin MCP Server is a secure toolkit that connects agents and automated workflows to common Microsoft 365 administrative tasks. It currently supports bulk user onboarding via CSV (validation, preview, and provisioning) and a set of single-user profile operations. The server validates input rows, reports row-level errors with suggested corrections, and returns a preview before provisioning. It intentionally does not handle license purchase/assignment or role/group assignment. Typical scenarios include HR-driven new-hire provisioning, IT bulk onboarding, and admin automation that needs robust CSV validation and traceable operation reports.",
  "kind": "mcp",
  "vendor": "Microsoft",
  "externalDocumentation": {
    "title": "Agent 365 MCP Servers",
    "url": "https://aka.ms/AboutAgent365"
  },
  "remote": "https://agent365.svc.cloud.microsoft/agents/servers/mcp_AdminTools",
  "supportContactInfo": {
    "name": "customer support contact",
    "url": "https://aka.ms/a365mcpsupport"
  },
  "license": {
        "name": "Agent 365",
        "url": "https://aka.ms/AboutAgent365"
  },
  "visibility": "true",
  "categories": "IT & Management Tools",
  "icon": "",
  "useCases": [
    {
      "name": "Bulk add users (CSV)",
      "description": "Upload a CSV to create multiple user accounts in one operation; the server validates each row, reports row-level errors, and returns a validated preview before provisioning."
    },
    {
      "name": "CSV validation & actionable feedback",
      "description": "Validate CSV contents (required fields, formats) and return row-level diagnostics with suggested corrections (for example: missing username or first name) so administrators can fix inputs prior to provisioning."
    },
    {
      "name": "Preview & provision users",
      "description": "Provide a pre-provision preview of validated users (including normalized profile fields) and provision user accounts in bulk once an administrator confirms; license purchase/assignment and group/role assignment are intentionally out of scope."
    },
    {
      "name": "Single-user create & update",
      "description": "Create or update a single user's profile attributes (displayName, jobTitle, department, phones, addresses) programmatically or via an admin workflow."
    },
    {
      "name": "Dry-run (simulate changes)",
      "description": "Run bulk operations in dry-run mode to simulate results and return expected outcomes and error counts without persisting changes to the tenant."
    },
    {
      "name": "Result reporting & export",
      "description": "Return a detailed operation report after provisioning (created/failed rows, error codes, and suggested remediations) and provide exportable artifacts (CSV/JSON) for auditing or downstream processing."
    },
    {
      "name": "Audit logging & operation tracing",
      "description": "Record and retrieve operation-level logs and traces (who ran the job, input file hash, timestamps, and outcomes) for compliance and troubleshooting."
    }
  ],
  "securitySchemes": {
    "a365adminoauth2": {
      "type": "oauth2",
      "description": "Authenticate with A365 using OAuth2 authorization code flow with PKCE support.",
      "flows": ["authorizationCode"],
      "authorizationUrl": "https://login.microsoftonline.com",
      "tokenUrl": "https://login.microsoftonline.com",
      "refreshUrl": "https://login.microsoftonline.com",
      "scopes": ["ea9ffc3e-8a23-4a7d-836d-234d7c7565c1/McpServers.M365Admin.All"]
    }
  },
  "authSchemas":["OAuth2"],
  "audience": "ea9ffc3e-8a23-4a7d-836d-234d7c7565c1",
  "versionName": "original",
  "preview": true
}
